Repository: OneEyed1366/skiffy-messenger
Catalog: lib/l10n/arb/app_*.arb
Languages: es, ru

# textFieldSearchHint
source: Search...
es: Buscar...
ru: Поиск...

# textFieldShowPassword
source: Show password
es: Mostrar contraseña
ru: Показать пароль

# textFieldHidePassword
source: Hide password
es: Ocultar contraseña
ru: Скрыть пароль

# validatorEmailRequired
source: Enter email address
es: Ingrese dirección de correo
ru: Введите email адрес

# validatorEmailInvalid
source: Enter valid email address
es: Ingrese dirección de correo válida
ru: Введите корректный email адрес

# validatorPasswordRequired
source: Enter password
es: Ingrese contraseña
ru: Введите пароль

# validatorPasswordMinLength
source: Password must contain at least {minLength} characters
es: La contraseña debe contener al menos {minLength} caracteres
ru: Пароль должен содержать минимум {minLength} символов

# validatorPasswordUppercase
source: Password must contain an uppercase letter
es: La contraseña debe contener una letra mayúscula
ru: Пароль должен содержать заглавную букву

# validatorPasswordLowercase
source: Password must contain a lowercase letter
es: La contraseña debe contener una letra minúscula
ru: Пароль должен содержать строчную букву

# validatorPasswordDigit
source: Password must contain a digit
es: La contraseña debe contener un dígito
ru: Пароль должен содержать цифру

# validatorMatrixIdRequired
source: Enter Matrix ID
es: Ingrese Matrix ID
ru: Введите Matrix ID

# validatorMatrixIdInvalid
source: Enter valid Matrix ID (@user:server.com)
es: Ingrese Matrix ID válido (@user:server.com)
ru: Введите корректный Matrix ID (@user:server.com)

# validatorFieldRequired
source: Field{fieldName} is required
es: Campo{fieldName} es requerido
ru: Поле{fieldName} обязательно для заполнения

# validatorMinLength
source: Minimum length: {minLength} characters
es: Longitud mínima: {minLength} caracteres
ru: Минимальная длина: {minLength} символов

# validatorMaxLength
source: Maximum length: {maxLength} characters
es: Longitud máxima: {maxLength} caracteres
ru: Максимальная длина: {maxLength} символов

# homeserverUrlLabel
source: Homeserver URL
es: URL del servidor doméstico
ru: URL домашнего сервера

# homeserverUrlHint
source: Enter your Matrix server address
es: Ingrese la dirección de su servidor Matrix
ru: Введите адрес вашего Matrix сервера

# homeserverUrlRequired
source: Homeserver URL is required
es: Se requiere la URL del servidor doméstico
ru: URL домашнего сервера обязателен

# homeserverInvalidUrlError
source: Please enter a valid HTTPS URL
es: Por favor ingrese una URL HTTPS válida
ru: Пожалуйста, введите корректный HTTPS URL

# homeserverNotHttpsError
source: URL must start with https://
es: La URL debe comenzar con https://
ru: URL должен начинаться с https://

# homeserverConnectionError
source: Unable to connect to server
es: No se puede conectar al servidor
ru: Не удается подключиться к серверу

# homeserverNotMatrixError
source: The specified address is not a Matrix server
es: La dirección especificada no es un servidor Matrix
ru: Указанный адрес не является сервером Matrix

# homeserverVerifying
source: Verifying server...
es: Verificando servidor...
ru: Проверка сервера...

# homeserverNetworkOfflineError
source: No internet connection. Please check your network.
es: Sin conexión a internet. Verifique su conexión de red.
ru: Нет подключения к интернету. Проверьте ваше сетевое соединение.

# homeserverServerUnreachableError
source: Cannot reach server. Check URL or try again later.
es: No se puede alcanzar el servidor. Verifique la URL o intente más tarde.
ru: Не удается достичь сервер. Проверьте URL или попробуйте позже.

# homeserverVerifiedMessage
source: Server verified successfully
es: Servidor verificado exitosamente
ru: Сервер успешно проверен

# continueButton
source: Continue
es: Continuar
ru: Продолжить

# resetToDefaultButton
source: Reset to Default
es: Restablecer al predeterminado
ru: Сбросить на стандартный

# homeserverCapabilityDetectionInProgress
source: Detecting supported login methods...
es: Detectando métodos de inicio de sesión compatibles...
ru: Определение поддерживаемых методов входа...

# homeserverCapabilityDetectionRetrying
source: Retrying connection...
es: Reintentando conexión...
ru: Повторная попытка подключения...

# homeserverCapabilityDetectionTimeout
source: Detection taking longer than expected. Please check your connection.
es: La detección está tardando más de lo esperado. Por favor, verifique su conexión.
ru: Определение занимает больше времени, чем ожидалось. Проверьте ваше соединение.

# homeserverCapabilityNetworkError
source: Network error. Please check your connection and try again.
es: Error de red. Por favor, verifique su conexión e intente nuevamente.
ru: Ошибка сети. Проверьте ваше соединение и попробуйте снова.

# homeserverCapabilityInvalidHomeserver
source: Cannot determine authentication methods. Please verify your homeserver URL.
es: No se pueden determinar los métodos de autenticación. Por favor, verifique la URL de su servidor doméstico.
ru: Не удается определить методы аутентификации. Проверьте URL домашнего сервера.

# homeserverCapabilityServerUnreachableError
source: Cannot reach homeserver. Please check the URL and your connection.
es: No se puede alcanzar el servidor doméstico. Por favor, verifique la URL y su conexión.
ru: Не удается достичь домашний сервер. Проверьте URL и ваше соединение.

# homeserverCapabilityTimeoutError
source: Connection timeout. Please check your network and try again.
es: Tiempo de conexión agotado. Por favor, verifique su red e intente nuevamente.
ru: Превышено время ожидания подключения. Проверьте вашу сеть и попробуйте снова.

# authSignInWithPassword
source: Sign in with password
es: Iniciar sesión con contraseña
ru: Войти с паролем

# authSignInWithSSO
source: Sign in with SSO
es: Iniciar sesión con SSO
ru: Войти через SSO

# authNoMethodsAvailable
source: No authentication methods available for this homeserver
es: No hay métodos de autenticación disponibles para este servidor doméstico
ru: Нет доступных методов аутентификации для этого домашнего сервера
